Reports/ЛБ_ЗалоговыеБилетыПоДоговоруВИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЛБ_ЗалоговыеБилетыПоДоговоруВИП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказИндивидуальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодатели</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриказСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитМакет</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменяемыйПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказИндивидуальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДиапазонСуммЗайма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменяемыйПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказИндивидуальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Металл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеМеталлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проба</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтклонениеОтБазовойЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменяемыйПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказИндивидуальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтклонениеОтБазовойЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КачествоОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КачествоОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОборотыПоОперациямЗайма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОборотыПоОперациямЗайма</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплатыПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплатыЗайм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаБлокировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Comment>Залоговый билет</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОперацияПоЗалогу</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Comment>Ломбард</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийПриказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийПриказы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьВИП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыЗалоговыхБилетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвественноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВНакладную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъявленТорг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправкеОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ЛБ_ЗалоговыеБилетыПоДоговоруВИП/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДатаНач") Тогда
		Отчет.ДатаНач = Параметры.ДатаНач;
	КонецЕсли;

	Если Параметры.Свойство("ДатаКон") Тогда
		Отчет.ДатаКон = КонецДня(Параметры.ДатаКон);
	КонецЕсли;

	Если Параметры.Свойство("Ссылка") Тогда
		Отчет.Залогодатели.Загрузить(Параметры.Ссылка.Залогодатели.Выгрузить(, "Залогодатель"));
		
		Для каждого СтрЗ Из Отчет.Залогодатели Цикл
			Отчет.Залогодатель = ?(Отчет.Залогодатель = "", СтрЗ.Залогодатель.Наименование, Отчет.Залогодатель + "; " + СтрЗ.Залогодатель.Наименование);
		КонецЦикла;
		
		Отчет.Приказ = Параметры.Ссылка;
		Отчет.ПриказСтрока = "Приказ №" + Параметры.Ссылка.НомерПриказа + " от " + Параметры.Ссылка.Дата;
	КонецЕсли;

	СформироватьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Интервал(Команда)
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода;
	
	Если ДиалогРедактирования.Редактировать() Тогда
		Отчет.ДатаНач	= ДиалогРедактирования.Период.ДатаНачала;
		Отчет.ДатаКон 	= ДиалогРедактирования.Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Результат.Очистить();  
	
	Результат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаключенныеДоговора";
	
	Макет = Отчет.РеквизитМакет;
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	Если Отчет.ДатаНач = Дата(1,1,1) Тогда 
	    ПериодОтчета = "на " + Формат(Отчет.ДатаКон, "ДФ=dd.MM.yyyy");
	Иначе
		ПериодОтчета = "за период с " + Формат(Отчет.ДатаНач, "ДФ=dd.MM.yyyy") + " по " + Формат(Отчет.ДатаКон, "ДФ=dd.MM.yyyy");
	КонецЕсли;	

	ОбластьШапка.Параметры.ОсновнойПриказ = "№ " + Отчет.Приказ.НомерПриказа + " от " + Отчет.Приказ.Дата;
	ОбластьШапка.Параметры.Период = ПериодОтчета;
	Результат.Вывести(ОбластьШапка); 

	Результат.НачатьАвтогруппировкуСтрок();
	
	Для каждого СтрЗ Из Отчет.Залогодатели Цикл
		
		//СтруктураОтмены = ПолучитьОтменыПриказа(Отчет.Приказ.Дата, Отчет.ДатаКон, СтрЗ.Залогодатель, Отчет.Приказ);
		//
		//СтруктураНовыйПриказ = ПроверитьНаличиеНовыхПриказов(Отчет.Приказ.Дата, Отчет.ДатаКон, СтрЗ.Залогодатель, Отчет.Приказ);

		//+МАН 25.08.25 Изменил
		ДатаКон = ?(Отчет.Приказ.ДатаОкончанияДействияПриказа <> Дата(1,1,1), Отчет.Приказ.ДатаОкончанияДействияПриказа, Отчет.ДатаКон);
		
		//СтруктураНовыйПриказ = ПроверитьНаличиеНовыхПриказов(Отчет.Приказ.Дата, Отчет.ДатаКон, СтрЗ.Залогодатель, Отчет.Приказ);
		СтруктураНовыйПриказ = ПроверитьНаличиеНовыхПриказов(Отчет.Приказ.Дата, ДатаКон, СтрЗ.Залогодатель, Отчет.Приказ);
		//-МАН
		
		СтруктураНовыйПриказ.Приказы.Свернуть("Приказ");
		
		КонецПериода = Дата(1,1,1);
		
		//тест = Новый ТаблицаЗначений;
		//тест.Скопировать()
		
		//ТЗПриказы = СтруктураНовыйПриказ.Приказы.Скопировать();
		
		//Для каждого СтрП Из СтруктураНовыйПриказ.Приказы Цикл
		//	НоваяСтр = ТЗПриказы.Добавить();
		//	НоваяСтр.Приказ = СтрП.Приказ;
		//КонецЦикла;

		//Если СтруктураОтмены.МаксДата = Дата(1,1,1) И СтруктураНовыйПриказ.Дата = Дата(1,1,1) Тогда
		//	КонецПериода = Отчет.ДатаКон;
		//ИначеЕсли СтруктураОтмены.МаксДата <> Дата(1,1,1) ИЛИ СтруктураНовыйПриказ.Дата <> Дата(1,1,1) Тогда
		//	Если СтруктураОтмены.МаксДата > СтруктураНовыйПриказ.Дата И СтруктураНовыйПриказ.Дата = Дата(1,1,1) Тогда
		//		КонецПериода = СтруктураОтмены.МаксДата;
		//	ИначеЕсли СтруктураОтмены.МаксДата > СтруктураНовыйПриказ.Дата И СтруктураНовыйПриказ.Дата <> Дата(1,1,1) Тогда
		//		КонецПериода = СтруктураНовыйПриказ.Дата;
		//	ИначеЕсли СтруктураОтмены.МаксДата < СтруктураНовыйПриказ.Дата И СтруктураОтмены.МаксДата = Дата(1,1,1) Тогда
		//		КонецПериода = СтруктураНовыйПриказ.Дата;
		//	ИначеЕсли СтруктураОтмены.МаксДата < СтруктураНовыйПриказ.Дата И СтруктураОтмены.МаксДата <> Дата(1,1,1) Тогда
		//		КонецПериода = СтруктураОтмены.МаксДата;
		//	Иначе
		//		КонецПериода = Отчет.ДатаКон;
		//	КонецЕсли;
		//КонецЕсли;
		
		Если СтруктураНовыйПриказ.Дата = Дата(1,1,1) Тогда
			//+МАН 25.08.25 Изменил
			//КонецПериода = Отчет.ДатаКон;
			КонецПериода = ДатаКон;
			//-МАН
		Иначе
			КонецПериода = СтруктураНовыйПриказ.Дата;
		КонецЕсли;
		
		ДокументыПоПриказу = ПолучитьДокументы(Отчет.ДатаНач, КонецПериода, СтрЗ.Залогодатель);
		
		ПриказыДоп = "";
		//Предыдущий = "";
		Нпп = 1;
		
		Если ДокументыПоПриказу.Количество() > 0 Тогда
			ОбластьСтрокаЗалогодатель = Макет.ПолучитьОбласть("СтрокаЗалогодатель");
			ОбластьСтрокаЗалогодатель.Параметры.Залогодатель = СтрЗ.Залогодатель.Наименование;
			
			Если СтруктураНовыйПриказ.Приказы.Количество() > 0 Тогда
				Для каждого СтрП Из СтруктураНовыйПриказ.Приказы Цикл
					//Если Предыдущий <> СтрП И СтруктураНовыйПриказ.Дата <> ?(НачалоДня(СтрП.ДатаНачалаДействияПриказа) > НачалоДня(СтрП.Дата), СтрП.ДатаНачалаДействияПриказа, СтрП.Дата) Тогда
					//Если Предыдущий <> СтрП Тогда
					Текст = "№ " +СтрП.Приказ.НомерПриказа + " от " + СтрП.Приказ.Дата;
					ВидП = ?(СтрП.Приказ.ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.ВИП, "новый приказ ", "приказ отмены ");
					ПриказыДоп = ?(ПриказыДоп = "", "(" + ВидП + Текст, ПриказыДоп + ", " + ВидП + Текст);
					//Предыдущий = СтрП;
					//КонецЕсли;
					
					Если Нпп = СтруктураНовыйПриказ.Приказы.Количество() > 0 Тогда
						ПриказыДоп = ПриказыДоп + ")";
					КонецЕсли;

					Нпп = Нпп + 1;

				КонецЦикла;
			КонецЕсли;
			
			//Предыдущий = "";
			
			//Если СтруктураОтмены.Приказы.Количество() > 0 Тогда
			//	Для каждого СтрП Из СтруктураОтмены.Приказы Цикл
			//		//Если Предыдущий <> СтрП И СтруктураОтмены.МаксДата <> ?(НачалоДня(СтрП.ДатаНачалаДействияПриказа) > НачалоДня(СтрП.Дата), СтрП.ДатаНачалаДействияПриказа, СтрП.Дата) Тогда
			//		Если Предыдущий <> СтрП Тогда
			//			Текст = "№ " +СтрП.НомерПриказа + " от " + СтрП.Дата;
			//			ПриказыДоп = ?(ПриказыДоп = "", "приказ отмены " + Текст, ПриказыДоп + ", приказ отмены " + Текст);
			//			Предыдущий = СтрП;
			//		КонецЕсли;
			//	КонецЦикла;
			//КонецЕсли;
			
			ОбластьСтрокаЗалогодатель.Параметры.ПриказыДоп = ПриказыДоп;
			
			Результат.Вывести(ОбластьСтрокаЗалогодатель, 1);
		КонецЕсли;

		Для каждого Стр Из ДокументыПоПриказу Цикл
			
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Стр);
			
			ОбластьСтрока.Параметры.Ставка = ЛБ_ОбщийМодуль.ПолучитьПроцентнуюСхемуЗБ(Стр.ЗалоговыйБилет, Стр.ПричинаПрименения);
			
			Если НЕ Стр.СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят И
				НЕ Стр.СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен И
				НЕ Стр.СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен И
				НЕ Стр.СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт Тогда

				СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(Стр.ЗалоговыйБилет);
				//+МАН 25.08.25 Изменил
				//ОбластьСтрока.Параметры.ДолгПроценты = ЛБ_ОбщийМодуль.РасчетПроцентов(Стр.ДатаНачалаРасчетаПроцентов, Отчет.ДатаКон, ОбластьСтрока.Параметры.Ставка, Стр.ВыданоСуммаЗайма, СтруктураОкр.ОкруглятьЦены, СтруктураОкр.ВидОкругленияСуммыПроцентов, СтруктураОкр.ПорядокОкругления, СтруктураОкр.ОкруглятьВБольшуюСторону);
		        ОбластьСтрока.Параметры.ДолгПроценты = ЛБ_ОбщийМодуль.РасчетПроцентов(Стр.ДатаНачалаРасчетаПроцентов, ДатаКон, ОбластьСтрока.Параметры.Ставка, Стр.ВыданоСуммаЗайма, СтруктураОкр.ОкруглятьЦены, СтруктураОкр.ВидОкругленияСуммыПроцентов, СтруктураОкр.ПорядокОкругления, СтруктураОкр.ОкруглятьВБольшуюСторону);
				//-МАН

			 КонецЕсли;
			
			Результат.Вывести(ОбластьСтрока, 2);
			
		КонецЦикла;
	КонецЦикла;
	
	Результат.ЗакончитьАвтогруппировкуСтрок(); 
	
	Результат.ФиксацияСверху = 5;
	Результат.ПоказатьУровеньГруппировокСтрок(0);

КонецПроцедуры

&НаСервере
Функция ПолучитьОтменыПриказа(ДатаНач, ДатаКон, Залогодатель, ОтменяемыйПриказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период
		|ИЗ
		//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПоследних(
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПервых(
		//|			&Дата,
		|			,
		|			Залогодатель В (&Залогодатель)
		|				И Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|				И ОтменяемыйПриказ = &ОтменяемыйПриказ) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		//|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия <= &Дата
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор КАК Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период КАК Период
		|ИЗ
		//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПоследних(
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПервых(
		//|			&Дата,
		|			,
		|			Залогодатель В (&Залогодатель)
		|				И Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|				И ОтменяемыйПриказ = &ОтменяемыйПриказ) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|ГДЕ
		//|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия <= &Дата
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор КАК Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период КАК Период
		|ИЗ
		//|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПоследних(
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПервых(
		//|			&Дата,
		|			,
		|			Залогодатель В (&Залогодатель)
		|				И Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|				И ОтменяемыйПриказ = &ОтменяемыйПриказ) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|ГДЕ
		//|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия <= &Дата
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("ОтменяемыйПриказ", ОтменяемыйПриказ);
	
	Пакеты = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Ставки = Пакеты[0].Выгрузить();
	Металлы = Пакеты[1].Выгрузить();
	Вставки = Пакеты[2].Выгрузить();
	
	СтруктураВозврата = Новый Структура("Приказы, МаксДата");
	МассивПриказы = Новый Массив;
	
	МТип = Новый Массив;
	МТип.Добавить(Тип("ДокументСсылка.ЛБ_ПриказИндивидуальныеУсловия"));
	
	ОписаниеТиповПриказ = Новый ОписаниеТипов(МТип);
	
	ТЗПриказы = Новый ТаблицаЗначений;
	ТЗПриказы.Колонки.Добавить("Приказ", ОписаниеТиповПриказ);
	
	МассивУдаленияСтрок = Новый Массив;

	ТЗСтавки = ОтменяемыйПриказ.СтавкиПроцентов.Выгрузить(, "Ставка");
	
	Для каждого СтрС Из ТЗСтавки Цикл
		Если СтрС.Ставка = 0 Тогда
			МассивУдаленияСтрок.Добавить(СтрС);
		КонецЕсли;			
	КонецЦикла;
	
	Если МассивУдаленияСтрок.Количество() > 0 Тогда
		Для каждого СтрМ Из МассивУдаленияСтрок Цикл
			ТЗСтавки.Удалить(СтрМ);
		КонецЦикла;
	КонецЕсли;

	УстановленныСтавки = ТЗСтавки.Количество() > 0;
	УстановленныМеталлы = ОтменяемыйПриказ.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0;
	УстановленныВставки = ОтменяемыйПриказ.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0;
	
	МаксДатаСтавки = Дата(1,1,1);
	МаксДатаМеталлы = Дата(1,1,1);
	МаксДатаВствки = Дата(1,1,1);
	
	Если УстановленныСтавки Тогда
		Для каждого СтрС Из Ставки Цикл
			МаксДатаСтавки = Макс(МаксДатаСтавки, ?(НачалоДня(СтрС.ДатаНачалаДействия) > НачалоДня(СтрС.Период), СтрС.ДатаНачалаДействия, СтрС.Период));
			//МассивПриказы.Добавить(СтрС.Регистратор);
			НоваяСтр = ТЗПриказы.Добавить();
			НоваяСтр.Приказ = СтрС.Регистратор;
		КонецЦикла;
	КонецЕсли;
	
	//Если МаксДатаСтавки = Дата(1,1,1) И УстановленныСтавки Тогда
	//	//МаксДатаСтавки = ?(ТекущаяДата() < Отчет.ДатаКон, Отчет.ДатаКон, ТекущаяДата());
	//	МаксДатаСтавки = Отчет.ДатаКон;
	//КонецЕсли;
	
	Если УстановленныМеталлы Тогда
		Для каждого СтрМ Из Металлы Цикл
			МаксДатаМеталлы = Макс(МаксДатаМеталлы, ?(НачалоДня(СтрМ.ДатаНачалаДействия) > НачалоДня(СтрМ.Период), СтрМ.ДатаНачалаДействия, СтрМ.Период));
			//МассивПриказы.Добавить(СтрМ.Регистратор);
			НоваяСтр = ТЗПриказы.Добавить();
			НоваяСтр.Приказ = СтрМ.Регистратор;
		КонецЦикла;
	КонецЕсли;

	//Если МаксДатаМеталлы = Дата(1,1,1) И УстановленныМеталлы Тогда
	//	//МаксДатаМеталлы = ?(ТекущаяДата() < Отчет.ДатаКон, Отчет.ДатаКон, ТекущаяДата());
	//	МаксДатаМеталлы = Отчет.ДатаКон;
	//КонецЕсли;
	
	Если УстановленныВставки Тогда
		Для каждого СтрВ Из Вставки Цикл
			МаксДатаВствки = Макс(МаксДатаВствки, ?(НачалоДня(СтрВ.ДатаНачалаДействия) > НачалоДня(СтрВ.Период), СтрВ.ДатаНачалаДействия, СтрВ.Период));
			//МассивПриказы.Добавить(СтрВ.Регистратор);
			НоваяСтр = ТЗПриказы.Добавить();
			НоваяСтр.Приказ = СтрВ.Регистратор;
		КонецЦикла;
	КонецЕсли;
	
	//Если МаксДатаВствки = Дата(1,1,1) И УстановленныВставки Тогда
	//	//МаксДатаВствки = ?(ТекущаяДата() < Отчет.ДатаКон, Отчет.ДатаКон, ТекущаяДата());
	//	МаксДатаВствки = Отчет.ДатаКон;
	//КонецЕсли;
	
	//СтруктураВозврата.Приказы = МассивПриказы;
	СтруктураВозврата.Приказы = ТЗПриказы;
	СтруктураВозврата.МаксДата = Макс(МаксДатаСтавки, МаксДатаМеталлы, МаксДатаВствки);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция ПолучитьДокументы(ДатаНач, ДатаКон, Залогодатель)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОборотыПоОперациямЗаймаОбороты.Залогодатель КАК Залогодатель,
		|	ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет.НомерЗалоговогоБилета КАК НомерЗБ,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗБ,
		|	ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет.Ломбард КАК Ломбард,
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение,
		|	ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет.Дата КАК ДатаПриема,
		|	"" "" КАК ПризнакЭЗБ,
		|	ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет.ПроцентнаяСхема КАК Ставка,
		|	ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет.ПСКГод КАК ПСК,
		|	ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаСсудыОборот КАК СуммаСсудыОборот,
		|	ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет.СуммаСсуды КАК ВыданоСуммаЗайма,
		|	ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаОплатыЗаймОборот + ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаОплатыПроцентыОборот КАК ОплаченоВсего,
		|	ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаОплатыЗаймОборот КАК ОплаченоТелоЗайма,
		|	ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаОплатыПроцентыОборот КАК ОплаченоПроценты,
		|	ВЫБОР
		|		КОГДА ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет.СуммаСсуды - (ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаОплатыЗаймОборот + ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаОплатыПроцентыОборот) <= 0
		|			ТОГДА 0
		|		ИНАЧЕ ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет.СуммаСсуды - (ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаОплатыЗаймОборот + ЛБ_ОборотыПоОперациямЗаймаОбороты.СуммаОплатыПроцентыОборот)
		|	КОНЕЦ КАК ДолгЗайм,
		|	"" "" КАК ДолгПроценты,
		|	ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет.СхемаКредитования КАК ЗалоговыйБилетСхемаКредитования,
		|	ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
		|	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов
		|ИЗ
		|	РегистрНакопления.ЛБ_ОборотыПоОперациямЗайма.Обороты(&ДатаНач, &ДатаКон, Авто, Залогодатель В (&Залогодатель)) КАК ЛБ_ОборотыПоОперациямЗаймаОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&ДатаКон, ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|		ПО ЛБ_ОборотыПоОперациямЗаймаОбороты.Ломбард = ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&ДатаКон, ) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
		|		ПО ЛБ_ОборотыПоОперациямЗаймаОбороты.ЗалоговыйБилет = ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ОборотыПоОперациямЗаймаОбороты.Залогодатель.Наименование,
		|	ДатаПриема,
		|	НомерЗБ";
	
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)
	Отчет.ДатаКон = КонецДня(Дата(Элемент.ВыделенныйТекст))
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеНовыхПриказов(ДатаНач, ДатаКон, Залогодатель, ПриказУстановки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Регистратор КАК Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период КАК Период,
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаНачалаДействия КАК ДатаНачалаДействия,
		//+МАН 25.08.25 Добавил
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.ДатаОкончанияДействия КАК ДатаОкончанияДействия
		//-МАН
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.СрезПервых(
		|			&ДатаНач,
		|			Залогодатель В (&Залогодатель)
		|				И ВЫБОР
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА ОтменяемыйПриказ = &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА Регистратор <> &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ) КАК ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаПрейскурантаПроцентныхСтавок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период,
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаНачалаДействия,
		//+МАН 25.08.25 Добавил
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.ДатаОкончанияДействия
		//-МАН
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.СрезПервых(
		|			&ДатаНач,
		|			Залогодатель В (&Залогодатель)
		|				И ВЫБОР
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА ОтменяемыйПриказ = &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА Регистратор <> &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ) КАК ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаРасчетаОценкиЗалога.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Регистратор,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период,
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаНачалаДействия,
		//+МАН 25.08.25 Добавил
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.ДатаОкончанияДействия
		//-МАН
		|ИЗ
		|	РегистрСведений.ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.СрезПервых(
		|			&ДатаНач,
		|			Залогодатель В (&Залогодатель)
		|				И ВЫБОР
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ОтменитьВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА ОтменяемыйПриказ = &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					КОГДА Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПриказы.ВИП)
		|						ТОГДА ВЫБОР
		|								КОГДА Регистратор <> &Регистратор
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ЛОЖЬ
		|							КОНЕЦ
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ) КАК ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок
		|ГДЕ
		|	ЛБ_ИндивидуальнаяНастройкаОценкиДрагоценныхВставок.Период МЕЖДУ &ДатаНач И &ДатаКон
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачалаДействия";

	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
	Запрос.УстановитьПараметр("Регистратор", ПриказУстановки);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СтруктураВозврата = Новый Структура("Приказы, Дата");
	МассивПриказы = Новый Массив;
	
	МТип = Новый Массив;
	МТип.Добавить(Тип("ДокументСсылка.ЛБ_ПриказИндивидуальныеУсловия"));
	
	ОписаниеТиповПриказ = Новый ОписаниеТипов(МТип);
	
	ТЗПриказы = Новый ТаблицаЗначений;
	ТЗПриказы.Колонки.Добавить("Приказ", ОписаниеТиповПриказ);
	
	МассивУдаленияСтрок = Новый Массив;
	
	ТЗСтавки = ПриказУстановки.СтавкиПроцентов.Выгрузить(, "Ставка");
	
	Для каждого СтрС Из ТЗСтавки Цикл
		Если СтрС.Ставка = 0 Тогда
			МассивУдаленияСтрок.Добавить(СтрС);
		КонецЕсли;			
	КонецЦикла;
	
	Если МассивУдаленияСтрок.Количество() > 0 Тогда
		Для каждого СтрМ Из МассивУдаленияСтрок Цикл
			ТЗСтавки.Удалить(СтрМ);
		КонецЦикла;
	КонецЕсли;

	УстановленныСтавки = ТЗСтавки.Количество() > 0;
	УстановленныМеталлы = ПриказУстановки.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0;
	УстановленныВставки = ПриказУстановки.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0;

	Для каждого Стр Из РезультатЗапроса Цикл
		Если УстановленныСтавки Тогда
			Если Стр.Регистратор.СтавкиПроцентов.Количество() > 0 Тогда
					
					ТЗСтавки.Очистить();
					МассивУдаленияСтрок.Очистить();
					
					ТЗСтавки = Стр.Регистратор.СтавкиПроцентов.Выгрузить(, "Ставка");
					
					Для каждого СтрТЗ Из ТЗСтавки Цикл
						Если СтрТЗ.Ставка = 0 Тогда
							МассивУдаленияСтрок.Добавить(СтрТЗ);
						КонецЕсли;			
					КонецЦикла;
					
					Если МассивУдаленияСтрок.Количество() > 0 Тогда
						Для каждого СтрМ Из МассивУдаленияСтрок Цикл
							ТЗСтавки.Удалить(СтрМ);
						КонецЦикла;
					КонецЕсли;

					Если ТЗСтавки.Количество() > 0 Тогда
						//+МАН 25.08.25 Изменил
						//УстановленныСтавки = НЕ ТЗСтавки.Количество() > 0;
						
						Если Стр.ДатаОкончанияДействия <> Дата(1,1,1) И Стр.ДатаОкончанияДействия < ДатаКон Тогда
							УстановленныСтавки = Ложь;
						Иначе	
							УстановленныСтавки = НЕ ТЗСтавки.Количество() > 0;
						КонецЕсли;
						//-МАН
						
						НоваяСтр = ТЗПриказы.Добавить();
						НоваяСтр.Приказ = Стр.Регистратор;
					КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если УстановленныМеталлы Тогда
			Если Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0 Тогда
				//+МАН 25.08.25 Изменил
				//УстановленныМеталлы = НЕ Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0;
				
				Если Стр.ДатаОкончанияДействия <> Дата(1,1,1) И Стр.ДатаОкончанияДействия < ДатаКон Тогда
					УстановленныМеталлы = Ложь;
				Иначе	
					УстановленныМеталлы = НЕ Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенМеталлы.Количество() > 0;
				КонецЕсли;
				//-МАН
				
				НоваяСтр = ТЗПриказы.Добавить();
				НоваяСтр.Приказ = Стр.Регистратор;
			КонецЕсли;
		КонецЕсли;
		
		Если УстановленныВставки Тогда
			Если Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0 Тогда
				//+МАН 25.08.25 Изменил
				//УстановленныВставки = НЕ Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0;
				
				Если Стр.ДатаОкончанияДействия <> Дата(1,1,1) И Стр.ДатаОкончанияДействия < ДатаКон Тогда
					УстановленныВставки = Ложь;
				Иначе	
					УстановленныВставки = НЕ Стр.Регистратор.НастройкаОтклоненийОтБазовыхЦенВставки.Количество() > 0;
				КонецЕсли;
				//-МАН
				
				НоваяСтр = ТЗПриказы.Добавить();
				НоваяСтр.Приказ = Стр.Регистратор;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ УстановленныСтавки И НЕ УстановленныМеталлы И НЕ УстановленныВставки Тогда
			
			СтруктураВозврата.Приказы = ТЗПриказы;
			СтруктураВозврата.Дата = ?(НачалоДня(Стр.ДатаНачалаДействия) > НачалоДня(Стр.Период), Стр.ДатаНачалаДействия, Стр.Период);
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураВозврата.Приказы = ТЗПриказы;
	СтруктураВозврата.Дата = Дата(1,1,1);
	
	Возврат СтруктураВозврата;
	
КонецФункции
